Public Member Functions | Friends | List of all members
ACAPI::v1::View Class Reference
View Handling
A class that represents an Archicad navigator view. More...
#include <View.hpp>
 Inheritance diagram for ACAPI::v1::View:
 Public Member Functions
 const API_Guid &  | GetGuid () const
Retrieves the guid of the view.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
 const API_Token &  | GetToken () const
 Friends
Result< View >  | FindViewByGuid (const API_Guid &guid)
Constuct a view object referring to an existing Archicad view by guid.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Detailed Description
A class that represents an Archicad navigator view.
Friends And Related Symbol Documentation
◆ FindViewByGuid
 Result< View > FindViewByGuid  |  ( |  const API_Guid &  |  guid | )
friend
Constuct a view object referring to an existing Archicad view by guid.
It is compatible with the guid member of the API_NavigatorItem struct.
Parameters
guid | The guid of the view.